Plate/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.2 0 0);

boundaryField
{
    top
    {
        type            slip;
    }
    inlet
    {
        type            fixedValue;
        value		    uniform (0.2 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    plate
    {
        type            noSlip;
    }
    symmBound
    {
        type            slip;
    }
    frontAndBack
    {
        type            empty;
}
}

// ************************************************************************* //
